import{_ as t}from"./plugin-vue_export-helper-DlAUqK2U.js";import{c as o,a as n,o as a}from"./app-BAjpCnYW.js";const r={};function i(s,e){return a(),o("div",null,e[0]||(e[0]=[n("pre",null,[n("code",null,`我应该是一个不想生孩子的人，对生孩子并没有太多的期待。 
孩子会干扰我的生活，打乱我自己的节奏。
所以我和媳妇在结婚后就没打算那么快要孩子，我们是 20 年领证的，很是过了很久的二人世界。
然而并没有觉得过够了，在双方父母不停的催促下，我们开始了佛系备孕，大概是 23 年开始佛系备孕，到了 24 年还没有备上。
开始了认真的备孕，这个时候备孕更多的可能是因为环境的因素 让我们觉得是时候干这件事情了 我们两对这个也没有特别的抗拒。
然而事与愿违，整个 24 年认真的备孕 也没有备上，我们两做了各种检查，结果都挺好，专家说，你们要调整好心态，不能急。
我应该不急吧，媳妇可能心态有点崩， 可能是因为这么久还没有备上的缘故，从整个 24 开始 我们的生活就已经被还没来的孩子给打乱了。
25 年开年后不久，孩子来了。
刚刚得知的时候，嘴角难以抑制的裂开笑着，一连好几天，都是面带笑意，难以抑制。

我不知道这种反应从哪里来的，明明没有那么喜欢孩子，可能是人类繁衍的本能吧。
过来好些天，几个星期的样子，心情慢慢平复。
前几个月是最担心的时候，媳妇那时候还感染了新冠。我们去了好几次急诊。
前几个月媳妇也很辛苦，媳妇啥也不想吃，看见啥都想吐。

度过了艰苦的前几个月，进入了稍微舒服一点的孕中期，媳妇胃口好了些。我们偶尔也会出去玩玩。
也就是在这个期间，我抑郁了，现在回想，可能是因为生活变化太大了，在怀孕之前，我们节假日都出去玩出去溜达。怀孕之后，我们再也没有出去玩过了，每个周末都缩在家里，生怕出现一点意外。那个期间人真的很难受，也不知道怎么过来的，后来媳妇给我买了一台电脑，短暂的沉迷到游戏之中，人活了过来。

又过了几个月，进入到孕晚期。这个期间媳妇越来越辛苦了，身上这里也疼那里也疼，看着很是难受。
就这样难受的熬了几个月，快要生了。
最后一次去产检，去了医院被医生扣了下来，羊水不足，马上就要生了。
我们手足无措，就这样住院了。

住院后就给扎留置针了，我和护士说，轻一点，她怕疼。护士说这个很疼，忍一下。针扎进去的那一刻，媳妇嘴一瘪，眼泪刷刷的往下流。针疼的应该也有害怕的。 
后面和医生沟通确定第二天早上手术，那天晚上，我问媳妇，你紧张吗？她说还好。我感觉应该是有点紧张的吧。她总是这样，什么事情都藏在心里不表现出来。

这天晚上也没睡好，我们住的是三人间,一体化病房要三千一天，实在是住不起。这天晚上隔壁两个床位的孩子嗷嗷哭了一宿。我后面实在扛不住了睡了三个小时，媳妇一晚上都没怎么睡着。

第二天一早，护工来了，给媳妇推进手术室，我陪着看着她进手术室，我喊她：卢敏，回头。我拍了一张照片，她回头笑。
我想是紧张害怕的，但是不想我们担心吧。

医生不让我们在手术室外面等待，让我们回病房，我等不住，在病区的门口等着 回来的必经之路等着。
早上七点多一点进去的，等到了大概快十点的样子，孩子推出来了，我看着他感觉就和他妈一模一样，但是我内心里没有什么感觉，没有喜悦没有开心也没有激动，只是在想他妈怎么还没出来，问护士，护士说还要过一个小时。

我听了之后就在外面继续等 ，孩子在病房让他奶奶和外婆照顾着。

等的很久，他妈出来了，我看着她，说不出的滋味，我问她疼吗？她说不疼。应该还在麻药期间吧。

这是孩子出生的第一天，我感觉我是个冷血的父亲，我感觉我对他没有感情。嗯 我感觉我媳妇也对他没啥感情，我们是一类人可能，因为我看媳妇也没怎么看孩子。

在医院里，每天都睡不好，每天晚上总是哭声一片，唯一值得安慰的是我们孩子不怎么哭，算是比较乖的孩子了。

慢慢的媳妇慢慢身体开始恢复了，第三天的时候，我扶着她下地走路，她突然和我说 感觉生孩子也就那样，好像也没啥。我心里吓了一跳，我说: 你这是好了伤疤忘了疼。我们俩达成统一，绝对不生二胎。

第四天我们出院了，在医院里我们请了护工阿姨，孩子和孩子妈都被照顾的很好。

这一天晚上，挑战就来了，晚上孩子一直哭，放到床上就哭，我给孩子抱在怀里，他一抽一抽的，我很害怕，就带他去急诊了。
医生说才第四天就过来了啊，给开了一盒益生菌，说没事。
我们回去了，但是孩子放床上还是哭，后面孩子奶奶给孩子抱到她房间睡下了。后面我推测可能是开了取暖器比较干燥。或者孩子被护工阿姨带习惯了 不适应。

就这样新手爸妈新手奶奶外婆开始了带孩子，过了几天，孩子妈买的黄疸仪器到了，一检查二十多，我晚上一查二十多会导致孩子脑损伤的，害怕的不行。我们带孩子去了二院急诊，检测一下 16，也很高，二院医生建议我们去浙一，然后我们去了浙一急诊。
浙一急诊建议我们抽血住院。我们犹豫之后觉得先给孩子抽血看看，就在抽血的那一刻，看到那么粗的针头扎到孩子只有我大拇指粗细的胳膊上面的时候，我揪心的不行，特别难受。 这一刻我怀疑我被激素劫持了，明明平时对他没什么感觉，就像没有感情一样 为啥他受伤的时候会这么难受。媳妇也很难受，但是媳妇不说，不像我表现的很明显 喷完奶奶喷外婆，孩子奶奶很委屈，孩子外婆很生气。

到这里为止，才发现 对这个刚出生的小东西是有感情的。只是平时没有表现出来。

从他还未出生开始，可能就在经历一种心理上面的转变，到出生之后 转变到了一个新的阶段，目前应该还在转变之中。

初为人父，手足无措。

在这里想到了很久之前我爸就和我说，以后给我养到 18 岁就不管了，结果到现在为止还在管着，倾尽全力的帮着我。
我以后也会这样吗？ 很难想象。
`)],-1)]))}const m=t(r,[["render",i],["__file","20251225EssayOfChuWeiRenFu.html.vue"]]),l=JSON.parse('{"path":"/essay/2025/20251225EssayOfChuWeiRenFu.html","title":"初为人父 随笔","lang":"zh-CN","frontmatter":{"title":"初为人父 随笔","date":"2025-12-25T19:51:18.000Z","description":"当父亲是一个什么的感觉","order":1987,"article":false,"isOriginal":true,"category":["随笔"],"tag":["2025随笔","八喜"],"head":[["meta",{"property":"og:url","content":"https://yeluozhiqiu.site/essay/2025/20251225EssayOfChuWeiRenFu.html"}],["meta",{"property":"og:site_name","content":"叶落知秋"}],["meta",{"property":"og:title","content":"初为人父 随笔"}],["meta",{"property":"og:description","content":"当父亲是一个什么的感觉"}],["meta",{"property":"og:type","content":"website"}],["meta",{"property":"og:locale","content":"zh-CN"}],["meta",{"property":"og:updated_time","content":"2025-12-25T11:51:34.000Z"}],["meta",{"property":"article:tag","content":"2025随笔"}],["meta",{"property":"article:tag","content":"八喜"}],["meta",{"property":"article:published_time","content":"2025-12-25T19:51:18.000Z"}],["meta",{"property":"article:modified_time","content":"2025-12-25T11:51:34.000Z"}],["script",{"type":"application/ld+json"},"{\\"@context\\":\\"https://schema.org\\",\\"@type\\":\\"WebPage\\",\\"name\\":\\"初为人父 随笔\\",\\"description\\":\\"当父亲是一个什么的感觉\\"}"]]},"headers":[],"git":{"createdTime":1766663494000,"updatedTime":1766663494000,"contributors":[{"name":"致良知","email":"caofangqi@outlook.com","commits":1}]},"readingTime":{"minutes":6.57,"words":1971},"filePathRelative":"essay/2025/20251225EssayOfChuWeiRenFu.md","localizedDate":"2025年12月25日","excerpt":""}');export{m as comp,l as data};
